/*题目：打印出所有的"水仙花数"，所谓"水仙花数"是指一个三位数，其各位数字立方和等于该数 本身。例如：153是一个"水仙花数"，因为153=1的三次方＋5的三次方＋3的三次方。

程序分析：利用for循环控制100-999个数，每个数分解出个位，十位，百位。
*/

#include <stdio.h>
#include <math.h>

//用变量存储各位对应的数字
//int  main()
//{
//    int i, ge, shi, bai;
//    for(i=100;i<1000;i++)
//    {
//        bai = i/100;
//        shi = (i%100)/10;
//        ge = i%10;
//        if(pow(ge, 3)+pow(shi, 3)+pow(bai, 3)==i)
//            printf("%d 是水仙花数\n", i);
//    }
//    return 0;
//}

//用数组存储各位对应的数字
int  main()
{
    int i, x[3];
    for(i=100;i<1000;i++)
    {
        x[2] = i/100;
        x[1] = (i%100)/10;
        x[0] = i%10;
        if(pow(x[2], 3)+pow(x[1], 3)+pow(x[0], 3)==i)
            printf("%d 是水仙花数\n", i);
    }
    return 0;
}
